{
  "homepage": "http://www.railcraft.info/",
  "1.12.2": {
    "12.0.0": "Updated for 1.12.2!"
  },
  "1.10.2": {
    "10.3.1": "FIX: Fix cart spawning due to obfuscation error, oops.",
    "10.3.0": "INFO: Merry Christmas!\nNEW: Added Snow to carts!\nNEW: Added Crowbar of Seasons, used to switch carts to Christmas or Halloween mode, found in Workshops or in Gift and Pumpkin Carts.\nNEW: Restored Creosote and Steam blocks. (contribution by liach)\nNEW: Added Creosote potion effect that harms spiders when thrown. (contribution by liach)\nCHANGE: 'NeedsRefuel' routing condition now looks at the entire train and considers Worldspike Carts as well.",
    "10.2.0": "NEW: Metal Posts and Platforms have been restored. Other variants will come later.\nNEW: World Anchors ported and renamed to Worldspikes.\nNEW: Ported Block Signals and Distant Signals.\nNEW: Token Signals have been added! Use to make junctions simpler and diagonals viable.\nNEW: Added Zinc and Brass. (contribution by GeneralCamo)\nNEW: Added Nickel-Iron and Nickel-Zinc batteries. Use them to help maintain your charge network.\nNEW: Added Logbook, it records any player that passes within a 16 block radius of the block and they day they visited. It can only be broken by the owner.\nNEW: Config files for the mine generator. Control everything about the generation, even create your own. \nNEW: Added Filter items that can be used in Loaders and Detectors to match groups of items.\nNEW: Filters include: Ore Dict Tag Filter, Metadata/NBT Ignore Filter, Generic Bee Filter, Bee Genome Filter.\nNEW: Added Coal Dust, Ender Dust, and Void Powder (Coal Dust + Obsidian Dust + Ender Dust).\nNEW: Added Crowbar Smack enchantment, super-boost Trains. (contribution by liach)\nNEW: Change the color of the smoker from Smokers using dyes. (contribution by liach)\nNEW: Jukebox Cart, with moving sounds! (contribution by liach)\nNEW: Whistles move with Locomotives! (contribution by liach)\nNEW: Added Bronze Borehead. (contribution by liach)\nNEW: Added support for comments in Routing Tables: // or #\nNEW: Added Shunting Aura to Goggles for inspecting train linkage issues.\nNEW: /railcraft debug now prints the debug info for the block/cart the player is looking at.\nCHANGE: Worldspike fuels have been rebalanced. Void Powder is the best default fuel now.\nCHANGE: Migrate Powered Rolling Machine from RF to Charge.\nCHANGE: Reworked crafting of various Charge related items. Added more intermediate items.\nCHANGE: Rework some recipes in minor ways. (contribution by GeneralCamo)\nCHANGE: Ore Dict Tag Plates, yes plates. You can stop whining now.  (contribution by GeneralCamo)\nCHANGE: Message Track command can now be used by just looking at the track you want to change and omitting the coords.\nCHANGE: Status messages now go to the hotbar instead of chat. (contribution by liach)\nCONFIG: Move Charge network debug spam to a config option.\nCONFIG: Fixed Enchantment enabled/disable config.\nCONFIG: Worldspike fuel config redesigned/renamed.\nFIX: Boxes now respond correctly to redstone. (contribution by liach)\nFIX: Improve Bore Head enchants and tool behavior. (contribution by liach)\nFIX: Fixed village bankrupting himself. (contribution by liach)\nFIX: Fix Bore infinite loop.\nFIX: Fix routing crash.\nFIX: Fix IC2 Feeder breaking. (contribution by liach)\nFIX: Fix Tank Cart issues. (contribution by liach)\nFIX: Various other minor fixes by liach.\nFIX: Fix Train Dispenser and Locomotive matching. Issue #1262\nFIX: Fix some annoying edge cases and faulty assumptions in the Item Loader code.\nFIX: Fix various bugs in the Charge Network code, mostly related to usage/loss tracking.\nFIX: Fix command permission levels issues.\nFIX: Fix Destruction enchant. (contribution by liach)\nFIX: Fix dupe bug with Tank Carts and Cargo Carts.\nFIX: Fix command exceptions due to vanilla method overlap.\nFIX: Outfitted Tracks should now drop both track and kit when destroyed/popped off. (contribution by liach)\nFIX: Exclude Command Block Minecarts from the entity cramming explosion code. Fixes World Preload Scripts.\nFIX: High Speed Track should have the correct speed values now.\nFIX: Dumping Track should check for empty space before dumping entities now.\nFIX: Fix cart bounding box position issues. Issue #946\nAPI: Moved some Cart Charge stuff to the API.\nEXPERIMENTAL: Steel Armor now has a toughness of 0.8. (contribution by GeneralCamo)\nEXPERIMENTAL: Various behind the scenes improvements to ItemStack handling to facilitate eventually upgrading to 1.11.",
    "10.1.2": "NEW: Restored and redesigned Elevator Tracks. Should be much less fiddly now.\nNEW: Restored Forestry backpacks.\nNEW: Add Bore Head Enchantment compatibility. (contribution by liach)\nNEW: Various IC2 integration fixes and improvements. (contribution by GeneralCamo)\nCHANGE: Poor Ore output increased to 3 nuggets instead of 2.\nFIX: Limit Enchantments to proper tools.\nFIX: Experiment fix for random train unlinking.\nFIX: Cart Disassembly recipes work again.\nFIX: Boxes and Actuators must be placed on solid surfaces again.\nFIX: Catch possible null entries before they get added to the creative list. (contribution by liach)\nAPI: Added a Train wide IItemHandler and IFluidHandler provider for interfacing with Architect.",
    "10.1.1": "NEW: Added reverse mode to Throttle Track. (contribution by Cream Tea)\nNEW: Zap sounds and effects.\nFIX: Fix crash when looking at an Admin Charge Feeder with TheOneProbe.\nFIX: Fix rendering issues with Box connections.\nFIX: Routing Detector and Actuator no longer call client code from the server and crash.\nFIX: Add temporary crafting recipe for the Charge Trap.",
    "10.1.0": "NEW: Smoker and Feed Station restored.\nNEW: Signal Boxes restored.\nNEW: Turnouts, Wyes, and Switch Actuators restored.\nNEW: Spike Maul is used to swap between Flex, Junction, Wye.\nNEW: Sounds restored.\nNEW: Added a SkyGen config for mines for testing purposes.\nNEW: Added Bronze, Nickel, and Invar ores and metals. (contribution by GeneralCamo)\nNEW: Added Brick variants of the new vanilla stone types. (contribution by GeneralCamo)\nNEW: Pearlized Brick an Ender Pearl themed Brick added. (contribution by GeneralCamo)\nNEW: Rolling Machine has been restored. Should fix most recipe issues.\nNEW: Added Manual Rolling Machine, it requires no power, but requires the player's presence to craft. Does not interact with pipes.\nNEW: Added Messenger Track Kit, a track that sends a chat message when passed. (contribution by liach)\nNEW: Riding and Ridden Routing conditionals replaced with the Rider conditional. See GitHub Issue #844 for details.\nNEW: Placing a malformed Routing Table into device will now pop up the GUI to tell you it is erroring.\nNEW: Sneak clicking with an empty hand on Routing device will now allow you to edit the contained Routing Table directly.\nNEW: You can now disable Railcraft enchantments, and moved to Magic module.\nCHANGED: Some of Brick recipes have been Tweaked to reflect various changes in Vanilla. (contribution by GeneralCamo)\nFIX: Various IC2 integration fixes. (contribution by GeneralCamo)\nFIX: Notepad should now interact with the world properly.\nFIX: Charge Feeders should now properly respond to Redstone under all conditions.\nFIX: Reduced Tunnel Bore log spam.",
    "10.0.1": "NEW: Add DynamicLighting support to Locomotive (contribution by liach)\nFIX: Fix config files not being generated correctly\nFIX: Various other minor fixes",
    "10.0.0": "INFO: First official MC 1.10.2 release\nNEW: Added in-game config editor support\nFIX: Fix various GUI issues\nFIX: Render Locomotive and Maintenance Cart Lamps\nFIX: Add Steam Locomotive Fluid Container handling\nFIX: Various other fixes",
    "10.0.0-beta-4": "NEW: Updated monster spawn list for Pumpkin Cart\nNEW: Ores and Geodes are now SimpleRetrogen compatible\nCHANGE: Mines are richer in Mountain, Mesa, and Hills types of biomes\nFIX: Various other fixes",
    "10.0.0-beta-3": "CHANGE: Rework Poor Ore worldgen. Replace with Mines, branching clouds of ore containing both Poor Ore and Standard Ore.\nCHANGE: Standardize Item and Texture names, may affect addons and resource packs, worlds should be unaffected.\nCONFIG: Added config option to reduce/eliminate vanilla Gold/Iron Ore generation.\nFIX: Fix Geode generation.\nFIX: Various other fixes."
  },
  "promos": {
    "1.12.2-latest": "12.0.0",
    "1.12.2-recommended": "12.0.0",
    "1.10.2-latest": "10.3.1",
    "1.10.2-recommended": "10.3.1"
  }
}